In [1]:
import pandas as pd
import numpy as np

# Diclosure control warm up excercises for apprentices

Based on the learning hub course Awarness of Atatistical Disclosure Control with content taken directly from it. 

A few notes before we get started so you dont have to keep switching betwen the course and here. 

**The General Data Protection Regulation [GDPR]** mandates protection for personal data from which the identities of individuals can be determined from the data itself and other sources held by the data controller.  It refers to "special categories" of data, for which additional care must be taken.  These include:

* ethnic origin
* political affiliation
* religion
* biometrics (for ID purposes)
* health
* sexual orientation

An intruder can be:  

* an acquaintance using information gained by **knowing the respondent**, or
* a stranger using information in the **public domain**.

## The Three Major Data Formats

Disclosure control can be applied to any of the following data structures:

* microdata
* frequency tables
* magnitude tables

Statistical information is often held in the form of microdata after collection. In microdata each row corresponds to a single respondent: a business, individual or other statistical unit.

Because microdata are often highly disclosive, they are generally aggregated into frequency tables or magnitude tables before release.

The remainder of the course will outline the risks that each of these data formats pose, and the associated disclosure methods that can be used to reduce the risk to an acceptable level.

##### In this notebook we will only cover microdata

### Protecting Microdata

There are a number of techniques used to protect microdata. The primary method is restricting access under certain license agreements, which will be covered later. Others include:

* Removing identifiers
* Perturbation (such as adding noise)
* Recoding
* Top Coding

#### Excercise 1.1 remove the identifiers from the excercise 1 dataset 

Difficulty: Easy

In [93]:
ex1 = pd.read_csv('data/ex01.csv', index_col = 0) # plz don't chnage this cell!!

In [94]:
ex1

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [4]:
ex1_1 = ex1.drop(columns=['Name', 'National Insurance Number']) # change this cell to include your solution

In [5]:
def function_name(input):
    # stuff
    return None

In [6]:
def remove_identifier(df_in):
    df_out = df_in.drop(columns= ['Name', 'National Insurance Number'])
    return df_out
# What i did was first created the name of the function which is remove_identifier, and then the input, i put in was df_in. After that I had to put things 
# in stuff. The best things was to put df_out this is a new name of the function which inclides the input which is df_in but we put the drop sequence in. 
# return (lower case r) was put with the new name

In [7]:
ex1_1 = remove_identifier(ex1)

In [8]:
ex1_1

   Age     Sex Marital Status  Income (£)
1   50    Male        Married     50000.0
2   16  Female        Widowed     18000.0
3   24  Female         Single     24000.0
4   80  Female        Widowed         NaN

#### Excercise 1.2 perturb the dataset acording to how unique the combination of values might be e.g. widows under 25 

Difficulty: Hard

In [9]:
ex1_2 = ex1 # change this cellto include your solution

In [101]:

ex1_2 = ex1.copy()

widows_under_25 = ex1_2[(ex1_2['Age'] <= 25) & (ex1_2['Marital Status'] == 'Widowed')]

ex1_2.loc[widows_under_25.index,'Age'] = 25
ex1_2

                 Name National Insurance Number  Age     Sex Marital Status  \
1          John Smith                 IE524614Z   50    Male        Married
2  Natalie Pennington                 NY473823T   25  Female        Widowed
3        Sarah Cooper                 WJ935996X   24  Female         Single
4        Rosa Pipwell                 WV162384O   80  Female        Widowed

   Income (£)
1     50000.0
2     18000.0
3     24000.0
4         NaN

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,25,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [102]:
import Disco_helper_functions as dhf

edited_df = dhf.change_age(ex1)

In [103]:
edited_df

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,25,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [100]:
ex1_2_a

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,25,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

#### Excercise 1.3 recode the dataset to change the marital status column 

Difficulty: Medium  

Hint: use a dictionary & map

In [14]:
ex1_3 = ex1 # change this cell to include your solution

In [15]:
marital_dict = {'Married': True, 'Single': False, 'Widowed': False}

In [71]:
ex1 = ex1_3['Married'] = ex1_3['Single'] = ex1_3['Widowed']

ext1_3['Is Married'] = ex1 ['Marital Status'].map(marital_dict)

ex1_3 = ex1_3.drop(columns=['Marital Status'])

ex1_3

KeyError: 'Widowed'

In [67]:
def change_marital_status(df):
    marital_dict = {'Married': True, 'Widowed': False, 'Single': False}
    df_out = df[df['Marital Status'].map(marital_dict)]
    df_out = df.drop(columns=['Marital Status'])
    return df_out

In [ ]:
ex1

#### Excercise 1.4 top or bottom coding

Difficulty: hmm... it kind of has levels
    
hint: Whats the rule for implimenting a chnage? whats the change that is implimented?

In [ ]:
ex1_4 = ex1 # change this cell to include your solution

In [ ]:
ex1_4 = ex1
un25 = ex1[(ex1['Age'] == 25)]
ex1_4.loc[un25.index, 'Age'] = '25'

In [ ]:
ex1_4 = ex1
un25 = ex1[(ex1['Age'] ==25)]
ex1_4.loc[un25.index, 'Age'] = '<=25'

un25